<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"terraform release/650066862270","backend":"164da939f88c0b32d48511863245608bc0b18622dfd06ac89040add0cc4979bb","plan_job_ref":"Job PR - Terraform Plan #30 at https://github.com/cabinetoffice/gpa-rosy-iac/actions/runs/14794104932","plan_out_hash":"e2b31a024eaeaa84e6084aebc4dc0f490fa143fd9fea28611d98dd50fdc647e5","plan_hash":"aaf08cbd1c7042c7abac74ea789bf87950b03b2127c93a1ae28294afd2bb2a69","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan for __terraform release/650066862270__
<details>
<summary>Plan: 22 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.emr.aws_emr_cluster.cluster will be created
+   resource "aws_emr_cluster" "cluster" {
+       applications                      = [
+           "Hadoop",
        ]
+       arn                               = (known after apply)
+       cluster_state                     = (known after apply)
+       configurations_json               = jsonencode(
            [
+               {
+                   Classification = "spark-defaults"
+                   Properties     = {
+                       "spark.driver.cores"                         = "4"
+                       "spark.driver.extraJavaOptions"              = "-XX:+UseG1GC -XX:InitiatingHeapOccupancyPercent=35 -XX:MaxGCPauseMillis=50 -Xss4m"
+                       "spark.driver.memory"                        = "8g"
+                       "spark.driver.memoryOverhead"                = "1024"
+                       "spark.executor.cores"                       = "4"
+                       "spark.executor.extraJavaOptions"            = "-XX:+UseG1GC -XX:InitiatingHeapOccupancyPercent=35 -XX:MaxGCPauseMillis=50 -Xss4m"
+                       "spark.executor.heartbeatInterval"           = "30s"
+                       "spark.executor.instances"                   = "4"
+                       "spark.executor.memory"                      = "16g"
+                       "spark.executor.memoryOverhead"              = "4096"
+                       "spark.executorEnv.AWS_DEFAULT_REGION"       = "eu-west-2"
+                       "spark.executorEnv.AWS_REGION"               = "eu-west-2"
+                       "spark.executorEnv.BASE_REST_URL"            = ""
+                       "spark.yarn.appMasterEnv.AWS_DEFAULT_REGION" = "eu-west-2"
+                       "spark.yarn.appMasterEnv.AWS_REGION"         = "eu-west-2"
+                       "spark.yarn.appMasterEnv.BASE_REST_URL"      = ""
                    }
                },
            ]
        )
+       custom_ami_id                     = "*********************"
+       ebs_root_volume_size              = 64
+       id                                = (known after apply)
+       keep_job_flow_alive_when_no_steps = true
+       master_public_dns                 = (known after apply)
+       name                              = "rosy-infra-emr-emr"
+       release_label                     = "emr-7.0.0"
+       scale_down_behavior               = (known after apply)
+       service_role                      = "rosy-infra-iam-emr-role"
+       step                              = (known after apply)
+       step_concurrency_level            = 1
+       tags_all                          = {
+           "ApplicationRole" = "Data Integration Layer DEV"
+           "Env"             = "dev"
+           "ManagedBy"       = "Terraform"
+           "Owner"           = "Data Platform Team"
        }
+       termination_protection            = true
+       visible_to_all_users              = true

+       bootstrap_action {
+           name = "bootstrap_latest"
+           path = (known after apply)
        }

+       core_instance_fleet {
+           id                             = (known after apply)
+           provisioned_on_demand_capacity = (known after apply)
+           provisioned_spot_capacity      = (known after apply)
+           target_on_demand_capacity      = 1
+           target_spot_capacity           = 0

+           instance_type_configs {
+               bid_price_as_percentage_of_on_demand_price = 100
+               instance_type                              = "m5.4xlarge"
+               weighted_capacity                          = 16

+               ebs_config {
+                   size                 = 64
+                   type                 = "gp2"
+                   volumes_per_instance = 2
                }
            }
        }

+       ec2_attributes {
+           emr_managed_master_security_group = (known after apply)
+           emr_managed_slave_security_group  = (known after apply)
+           instance_profile                  = (known after apply)
+           key_name                          = "rosy-infra-key-pair"
+           service_access_security_group     = (known after apply)
+           subnet_id                         = "************************"
+           subnet_ids                        = (known after apply)
        }

+       master_instance_fleet {
+           id                             = (known after apply)
+           provisioned_on_demand_capacity = (known after apply)
+           provisioned_spot_capacity      = (known after apply)
+           target_on_demand_capacity      = 1
+           target_spot_capacity           = 0

+           instance_type_configs {
+               bid_price_as_percentage_of_on_demand_price = 100
+               instance_type                              = "m5.4xlarge"
+               weighted_capacity                          = 1

+               ebs_config {
+                   size                 = 64
+                   type                 = "gp2"
+                   volumes_per_instance = 2
                }
            }
        }
    }

  # module.iam_emr_service_role.aws_iam_policy.policy will be created
+   resource "aws_iam_policy" "policy" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "rosy-infra-iam-emr-policy"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:GetDataProtectionPolicy",
+                           "logs:GetLogRecord",
+                           "logs:DeleteSubscriptionFilter",
+                           "logs:DescribeSubscriptionFilters",
+                           "logs:StartQuery",
+                           "logs:DescribeMetricFilters",
+                           "logs:GetDeliveryDestination",
+                           "logs:ListLogDeliveries",
+                           "logs:DeleteDeliveryDestinationPolicy",
+                           "logs:CreateLogStream",
+                           "logs:CreateLogAnomalyDetector",
+                           "logs:CancelExportTask",
+                           "logs:DeleteRetentionPolicy",
+                           "logs:GetLogEvents",
+                           "logs:FilterLogEvents",
+                           "logs:DescribeDestinations",
+                           "logs:GetDelivery",
+                           "logs:PutDataProtectionPolicy",
+                           "logs:UpdateAnomaly",
+                           "logs:Unmask",
+                           "logs:DeleteDeliverySource",
+                           "logs:StopQuery",
+                           "logs:DescribeDeliverySources",
+                           "logs:DeleteQueryDefinition",
+                           "logs:PutDeliverySource",
+                           "logs:CreateLogGroup",
+                           "logs:ListTagsForResource",
+                           "logs:Link",
+                           "logs:CreateLogDelivery",
+                           "logs:PutMetricFilter",
+                           "logs:PutResourcePolicy",
+                           "logs:DescribeExportTasks",
+                           "logs:GetDeliverySource",
+                           "logs:GetQueryResults",
+                           "logs:UpdateLogDelivery",
+                           "logs:PutDeliveryDestinationPolicy",
+                           "logs:DescribeDeliveries",
+                           "logs:PutSubscriptionFilter",
+                           "logs:DeleteDelivery",
+                           "logs:ListAnomalies",
+                           "logs:ListTagsLogGroup",
+                           "logs:DeleteDataProtectionPolicy",
+                           "logs:DescribeLogStreams",
+                           "logs:CreateDelivery",
+                           "logs:GetLogDelivery",
+                           "logs:DeleteLogStream",
+                           "logs:DeleteAccountPolicy",
+                           "logs:CreateExportTask",
+                           "logs:UpdateLogAnomalyDetector",
+                           "logs:DeleteResourcePolicy",
+                           "logs:DeleteMetricFilter",
+                           "logs:StartLiveTail",
+                           "logs:StopLiveTail",
+                           "logs:AssociateKmsKey",
+                           "logs:DeleteLogDelivery",
+                           "logs:DeleteLogAnomalyDetector",
+                           "logs:DescribeQueryDefinitions",
+                           "logs:DeleteDeliveryDestination",
+                           "logs:DescribeResourcePolicies",
+                           "logs:PutDestination",
+                           "logs:DescribeQueries",
+                           "logs:DisassociateKmsKey",
+                           "logs:DescribeLogGroups",
+                           "logs:DeleteLogGroup",
+                           "logs:ListLogAnomalyDetectors",
+                           "logs:PutDestinationPolicy",
+                           "logs:DescribeAccountPolicies",
+                           "logs:GetDeliveryDestinationPolicy",
+                           "logs:TestMetricFilter",
+                           "logs:PutQueryDefinition",
+                           "logs:DeleteDestination",
+                           "logs:PutAccountPolicy",
+                           "logs:GetLogAnomalyDetector",
+                           "logs:PutLogEvents",
+                           "logs:DescribeDeliveryDestinations",
+                           "logs:PutDeliveryDestination",
+                           "logs:PutRetentionPolicy",
+                           "logs:GetLogGroupFields",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "VisualEditor0"
                    },
+                   {
+                       Action   = [
+                           "cloudwatch:*",
+                           "dynamodb:*",
+                           "ec2:Describe*",
+                           "elasticmapreduce:Describe*",
+                           "elasticmapreduce:ListBootstrapActions",
+                           "elasticmapreduce:ListClusters",
+                           "elasticmapreduce:ListInstanceGroups",
+                           "elasticmapreduce:ListInstances",
+                           "elasticmapreduce:ListSteps",
+                           "kinesis:CreateStream",
+                           "kinesis:DeleteStream",
+                           "kinesis:DescribeStream",
+                           "kinesis:GetRecords",
+                           "kinesis:GetShardIterator",
+                           "kinesis:MergeShards",
+                           "kinesis:PutRecord",
+                           "kinesis:SplitShard",
+                           "rds:Describe*",
+                           "s3:*",
+                           "sdb:*",
+                           "sns:*",
+                           "sqs:*",
+                           "glue:CreateDatabase",
+                           "glue:UpdateDatabase",
+                           "glue:DeleteDatabase",
+                           "glue:GetDatabase",
+                           "glue:GetDatabases",
+                           "glue:CreateTable",
+                           "glue:UpdateTable",
+                           "glue:DeleteTable",
+                           "glue:GetTable",
+                           "glue:GetTables",
+                           "glue:GetTableVersions",
+                           "glue:CreatePartition",
+                           "glue:BatchCreatePartition",
+                           "glue:UpdatePartition",
+                           "glue:DeletePartition",
+                           "glue:BatchDeletePartition",
+                           "glue:GetPartition",
+                           "glue:GetPartitions",
+                           "glue:BatchGetPartition",
+                           "glue:CreateUserDefinedFunction",
+                           "glue:UpdateUserDefinedFunction",
+                           "glue:DeleteUserDefinedFunction",
+                           "glue:GetUserDefinedFunction",
+                           "glue:GetUserDefinedFunctions",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action   = [
+                           "ec2:AuthorizeSecurityGroupEgress",
+                           "ec2:AuthorizeSecurityGroupIngress",
+                           "ec2:CancelSpotInstanceRequests",
+                           "ec2:CreateFleet",
+                           "ec2:CreateLaunchTemplate",
+                           "ec2:CreateNetworkInterface",
+                           "ec2:CreateSecurityGroup",
+                           "ec2:CreateTags",
+                           "ec2:DeleteLaunchTemplate",
+                           "ec2:DeleteNetworkInterface",
+                           "ec2:DeleteSecurityGroup",
+                           "ec2:DeleteTags",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:DescribeAccountAttributes",
+                           "ec2:DescribeDhcpOptions",
+                           "ec2:DescribeImages",
+                           "ec2:DescribeInstanceStatus",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeKeyPairs",
+                           "ec2:DescribeLaunchTemplates",
+                           "ec2:DescribeNetworkAcls",
+                           "ec2:DescribeNetworkInterfaces",
+                           "ec2:DescribePrefixLists",
+                           "ec2:DescribeRouteTables",
+                           "ec2:DescribeSecurityGroups",
+                           "ec2:DescribeSpotInstanceRequests",
+                           "ec2:DescribeSpotPriceHistory",
+                           "ec2:DescribeSubnets",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeVpcAttribute",
+                           "ec2:DescribeVpcEndpoints",
+                           "ec2:DescribeVpcEndpointServices",
+                           "ec2:DescribeVpcs",
+                           "ec2:DetachNetworkInterface",
+                           "ec2:ModifyImageAttribute",
+                           "ec2:ModifyInstanceAttribute",
+                           "ec2:RequestSpotInstances",
+                           "ec2:RevokeSecurityGroupEgress",
+                           "ec2:RunInstances",
+                           "ec2:TerminateInstances",
+                           "ec2:DeleteVolume",
+                           "ec2:DescribeVolumeStatus",
+                           "ec2:DescribeVolumes",
+                           "ec2:DetachVolume",
+                           "iam:GetRole",
+                           "iam:GetRolePolicy",
+                           "iam:ListInstanceProfiles",
+                           "iam:ListRolePolicies",
+                           "iam:PassRole",
+                           "s3:CreateBucket",
+                           "s3:Get*",
+                           "s3:List*",
+                           "sdb:BatchPutAttributes",
+                           "sdb:Select",
+                           "sqs:CreateQueue",
+                           "sqs:Delete*",
+                           "sqs:GetQueue*",
+                           "sqs:PurgeQueue",
+                           "sqs:ReceiveMessage",
+                           "cloudwatch:PutMetricAlarm",
+                           "cloudwatch:DescribeAlarms",
+                           "cloudwatch:DeleteAlarms",
+                           "application-autoscaling:RegisterScalableTarget",
+                           "application-autoscaling:DeregisterScalableTarget",
+                           "application-autoscaling:PutScalingPolicy",
+                           "application-autoscaling:DeleteScalingPolicy",
+                           "application-autoscaling:Describe*",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
+                   {
+                       Action    = "iam:CreateServiceLinkedRole"
+                       Condition = {
+                           StringLike = {
+                               "iam:AWSServiceName" = "spot.amazonaws.com"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "arn:aws:iam::*:role/aws-service-role/spot.amazonaws.com/AWSServiceRoleForEC2Spot*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags        = {
+           "Name" = "rosy-infra-iam-emr-policy"
        }
+       tags_all    = {
+           "ApplicationRole" = "Data Integration Layer DEV"
+           "Env"             = "dev"
+           "ManagedBy"       = "Terraform"
+           "Name"            = "rosy-infra-iam-emr-policy"
+           "Owner"           = "Data Platform Team"
        }
    }

  # module.iam_emr_service_role.aws_iam_role.role will be created
+   resource "aws_iam_role" "role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "elasticmapreduce.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "rosy-infra-iam-emr-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Name" = "rosy-infra-iam-emr-role"
        }
+       tags_all              = {
+           "ApplicationRole" = "Data Integration Layer DEV"
+           "Env"             = "dev"
+           "ManagedBy"       = "Terraform"
+           "Name"            = "rosy-infra-iam-emr-role"
+           "Owner"           = "Data Platform Team"
        }
+       unique_id             = (known after apply)
    }

  # module.iam_emr_service_role.aws_iam_role_policy_attachment.attaching_custom_policies will be created
+   resource "aws_iam_role_policy_attachment" "attaching_custom_policies" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "rosy-infra-iam-emr-role"
    }

  # module.iam_emr_service_role.aws_iam_role_policy_attachment.attaching_managed_policies[0] will be created
+   resource "aws_iam_role_policy_attachment" "attaching_managed_policies" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEMRFullAccessPolicy_v2"
+       role       = "rosy-infra-iam-emr-role"
    }

  # module.iam_emr_service_role.aws_iam_role_policy_attachment.attaching_managed_policies[1] will be created
+   resource "aws_iam_role_policy_attachment" "attaching_managed_policies" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
+       role       = "rosy-infra-iam-emr-role"
    }

  # module.iam_role_emr_instance.aws_iam_policy.policy will be created
+   resource "aws_iam_policy" "policy" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "rosy-infra-ec2-policy"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:GetDataProtectionPolicy",
+                           "logs:GetLogRecord",
+                           "logs:DeleteSubscriptionFilter",
+                           "logs:DescribeSubscriptionFilters",
+                           "logs:StartQuery",
+                           "logs:DescribeMetricFilters",
+                           "logs:GetDeliveryDestination",
+                           "logs:ListLogDeliveries",
+                           "logs:DeleteDeliveryDestinationPolicy",
+                           "logs:CreateLogStream",
+                           "logs:CreateLogAnomalyDetector",
+                           "logs:CancelExportTask",
+                           "logs:DeleteRetentionPolicy",
+                           "logs:GetLogEvents",
+                           "logs:FilterLogEvents",
+                           "logs:DescribeDestinations",
+                           "logs:GetDelivery",
+                           "logs:PutDataProtectionPolicy",
+                           "logs:UpdateAnomaly",
+                           "logs:Unmask",
+                           "logs:DeleteDeliverySource",
+                           "logs:StopQuery",
+                           "logs:DescribeDeliverySources",
+                           "logs:DeleteQueryDefinition",
+                           "logs:PutDeliverySource",
+                           "logs:CreateLogGroup",
+                           "logs:ListTagsForResource",
+                           "logs:Link",
+                           "logs:CreateLogDelivery",
+                           "logs:PutMetricFilter",
+                           "logs:PutResourcePolicy",
+                           "logs:DescribeExportTasks",
+                           "logs:GetDeliverySource",
+                           "logs:GetQueryResults",
+                           "logs:UpdateLogDelivery",
+                           "logs:PutDeliveryDestinationPolicy",
+                           "logs:DescribeDeliveries",
+                           "logs:PutSubscriptionFilter",
+                           "logs:DeleteDelivery",
+                           "logs:ListAnomalies",
+                           "logs:ListTagsLogGroup",
+                           "logs:DeleteDataProtectionPolicy",
+                           "logs:DescribeLogStreams",
+                           "logs:CreateDelivery",
+                           "logs:GetLogDelivery",
+                           "logs:DeleteLogStream",
+                           "logs:DeleteAccountPolicy",
+                           "logs:CreateExportTask",
+                           "logs:UpdateLogAnomalyDetector",
+                           "logs:DeleteResourcePolicy",
+                           "logs:DeleteMetricFilter",
+                           "logs:StartLiveTail",
+                           "logs:StopLiveTail",
+                           "logs:AssociateKmsKey",
+                           "logs:DeleteLogDelivery",
+                           "logs:DeleteLogAnomalyDetector",
+                           "logs:DescribeQueryDefinitions",
+                           "logs:DeleteDeliveryDestination",
+                           "logs:DescribeResourcePolicies",
+                           "logs:PutDestination",
+                           "logs:DescribeQueries",
+                           "logs:DisassociateKmsKey",
+                           "logs:DescribeLogGroups",
+                           "logs:DeleteLogGroup",
+                           "logs:ListLogAnomalyDetectors",
+                           "logs:PutDestinationPolicy",
+                           "logs:DescribeAccountPolicies",
+                           "logs:GetDeliveryDestinationPolicy",
+                           "logs:TestMetricFilter",
+                           "logs:PutQueryDefinition",
+                           "logs:DeleteDestination",
+                           "logs:PutAccountPolicy",
+                           "logs:GetLogAnomalyDetector",
+                           "logs:PutLogEvents",
+                           "logs:DescribeDeliveryDestinations",
+                           "logs:PutDeliveryDestination",
+                           "logs:PutRetentionPolicy",
+                           "logs:GetLogGroupFields",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "VisualEditor0"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags        = {
+           "Name" = "rosy-infra-ec2-policy"
        }
+       tags_all    = {
+           "ApplicationRole" = "Data Integration Layer DEV"
+           "Env"             = "dev"
+           "ManagedBy"       = "Terraform"
+           "Name"            = "rosy-infra-ec2-policy"
+           "Owner"           = "Data Platform Team"
        }
    }

  # module.iam_role_emr_instance.aws_iam_role.role will be created
+   resource "aws_iam_role" "role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "rosy-infra-ec2-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Name" = "rosy-infra-ec2-role"
        }
+       tags_all              = {
+           "ApplicationRole" = "Data Integration Layer DEV"
+           "Env"             = "dev"
+           "ManagedBy"       = "Terraform"
+           "Name"            = "rosy-infra-ec2-role"
+           "Owner"           = "Data Platform Team"
        }
+       unique_id             = (known after apply)
    }

  # module.iam_role_emr_instance.aws_iam_role_policy_attachment.attaching_custom_policies will be created
+   resource "aws_iam_role_policy_attachment" "attaching_custom_policies" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "rosy-infra-ec2-role"
    }

  # module.iam_role_emr_instance.aws_iam_role_policy_attachment.attaching_managed_policies[0] will be created
+   resource "aws_iam_role_policy_attachment" "attaching_managed_policies" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
+       role       = "rosy-infra-ec2-role"
    }

  # module.iam_role_emr_instance.aws_iam_role_policy_attachment.attaching_managed_policies[1] will be created
+   resource "aws_iam_role_policy_attachment" "attaching_managed_policies" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = "rosy-infra-ec2-role"
    }

  # module.instance_profile_emr.aws_iam_instance_profile.ec2_instance_profile will be created
+   resource "aws_iam_instance_profile" "ec2_instance_profile" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = "rosy-infra-instance-profile-emr"
+       name_prefix = (known after apply)
+       path        = "/"
+       role        = "rosy-infra-ec2-role"
+       tags_all    = {
+           "ApplicationRole" = "Data Integration Layer DEV"
+           "Env"             = "dev"
+           "ManagedBy"       = "Terraform"
+           "Owner"           = "Data Platform Team"
        }
+       unique_id   = (known after apply)
    }

  # module.key_pair.aws_key_pair.generated_key_pair will be created
+   resource "aws_key_pair" "generated_key_pair" {
+       arn             = (known after apply)
+       fingerprint     = (known after apply)
+       id              = (known after apply)
+       key_name        = "rosy-infra-key-pair"
+       key_name_prefix = (known after apply)
+       key_pair_id     = (known after apply)
+       key_type        = (known after apply)
+       public_key      = (known after apply)
+       tags            = {
+           "ApplicationRole" = "ROSY Layer DEV"
+           "Managed by"      = "Terraform"
+           "Name"            = "rosy-infra-key-pair"
+           "Owner"           = "ROSY-INFRA"
+           "Region"          = "EU-WEST-2"
        }
+       tags_all        = {
+           "ApplicationRole" = "ROSY Layer DEV"
+           "Env"             = "dev"
+           "Managed by"      = "Terraform"
+           "ManagedBy"       = "Terraform"
+           "Name"            = "rosy-infra-key-pair"
+           "Owner"           = "ROSY-INFRA"
+           "Region"          = "EU-WEST-2"
        }
    }

  # module.key_pair.tls_private_key.key_pair will be created
+   resource "tls_private_key" "key_pair" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 2048
    }

  # module.s3_emr.aws_s3_bucket.s3bucket will be created
+   resource "aws_s3_bucket" "s3bucket" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "rosy-infra-ioblend-emr"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = true
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "ApplicationRole" = "ROSY Layer DEV"
+           "Managed by"      = "Terraform"
+           "Name"            = "rosy-infra-ioblend-emr"
+           "Owner"           = "ROSY-INFRA"
+           "Region"          = "EU-WEST-2"
        }
+       tags_all                    = {
+           "ApplicationRole" = "ROSY Layer DEV"
+           "Env"             = "dev"
+           "Managed by"      = "Terraform"
+           "ManagedBy"       = "Terraform"
+           "Name"            = "rosy-infra-ioblend-emr"
+           "Owner"           = "ROSY-INFRA"
+           "Region"          = "EU-WEST-2"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
    }

  # module.s3_emr.aws_s3_bucket_acl.bucket_acl will be created
+   resource "aws_s3_bucket_acl" "bucket_acl" {
+       acl    = "private"
+       bucket = (known after apply)
+       id     = (known after apply)
    }

  # module.s3_emr.aws_s3_bucket_notification.bucket_notification will be created
+   resource "aws_s3_bucket_notification" "bucket_notification" {
+       bucket      = (known after apply)
+       eventbridge = true
+       id          = (known after apply)
    }

  # module.s3_emr.aws_s3_bucket_ownership_controls.s3_bucket_acl_ownership will be created
+   resource "aws_s3_bucket_ownership_controls" "s3_bucket_acl_ownership" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.s3_emr.aws_s3_bucket_public_access_block.block_public_acls will be created
+   resource "aws_s3_bucket_public_access_block" "block_public_acls" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.s3_emr.aws_s3_bucket_server_side_encryption_configuration.enabling_encruption will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "enabling_encruption" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm = "aws:kms"
            }
        }
    }

  # module.s3_emr.aws_s3_bucket_versioning.enabling_versioning will be created
+   resource "aws_s3_bucket_versioning" "enabling_versioning" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

  # module.s3_object_copy.aws_s3_object.copy_file will be created
+   resource "aws_s3_object" "copy_file" {
+       bucket                 = (known after apply)
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "bootstrap_scripts/bootstrap.sh"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./modules/emr/bootstrap.sh"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "ApplicationRole" = "Data Integration Layer DEV"
+           "Env"             = "dev"
+           "ManagedBy"       = "Terraform"
+           "Owner"           = "Data Platform Team"
        }
+       version_id             = (known after apply)
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   s3_bucket_name = (known after apply)
```
</details>

:memo: Plan generated in [PR - Terraform Plan #30](https://github.com/cabinetoffice/gpa-rosy-iac/actions/runs/14794104932)